code-review/NRB_3471_3546/База_Было/Catalogs/РазделыСчетаДепо.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>РазделыСчетаДепо</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.СчетаДепо</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВходящийНомерПоручения</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Поручение</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗакрытияСчета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОткрытияСчета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Залогодержатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КраткийКодНРД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>8</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОперацияОткрытияСчета</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ОткрытиеРазделаСчетаДепо</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазделСчетаДепоМХ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РазделыСчетаДепоМХ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусСчетаДепо</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыСчетовДепо</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипРазделаСчетаДЕПО</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыРазделовСчетовДЕПО</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазделСубклиента</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Субклиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Субклиенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОперацияЗакрытияРаздела</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗакрытиеРазделаСчетаДепо</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписаниеПоПредписаниюБР</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Брокер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

code-review/NRB_3471_3546/База_Было/InformationRegisters/ПроцентыСписанияЦБСОбособленногоРаздела.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ПроцентыСписанияЦБСОбособленногоРаздела</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПроцентСписания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>РазделСчетаДЕПО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РазделыСчетаДепо</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

code-review/NRB_3471_3546/База_Было/Enums/ТипыРазделовСчетовДЕПО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыРазделовСчетовДЕПО</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Основной</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОсновнойВТББанк</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Торговый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обеспечения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбеспеченияДержатель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БлокированоКД</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БлокированоРасчеты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БлокированоПоАресту</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БлокированоИное</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БлокированоЗапретОпераций</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БлокированоВЗалоге</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БлокированоОбособленный</Name>
					<Comment>Блокировано (обособл. на основании федеральных законов и нормативно-правовых актов РФ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БлокированоОбособленныйПоПредписаниямБР</Name>
					<Comment>Блокировано (обособл. по предписаниям Банка России)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Налоговый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДляРаспределения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НИФИ</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

code-review/NRB_3471_3546/База_Было/Catalogs/РазделыСчетаДепо/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ВладелецСчетаДепо = Объект.Владелец.Владелец;
	УстановитьВидимостьИДоступностьЭлементовФормы();
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтаФорма);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	Если ПустаяСтрока(Объект.Наименование) Тогда
		Объект.Наименование = НаименованиеРазделаСчетаДепоНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	Если ПравоДоступа("Изменение", Метаданные.РегистрыСведений.ПроцентыСписанияЦБСОбособленногоРаздела) Тогда
		ПараметрыВРегистре = ПараметрыОбособленногоРаздела(ДатаИзмененияПроцентаСписания);
		Если ПроцентСписанияСРаздела <> ПараметрыВРегистре.ПроцентСписания Тогда
			НаборЗаписей = РегистрыСведений.ПроцентыСписанияЦБСОбособленногоРаздела.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.РазделСчетаДЕПО.Установить(Объект.Ссылка);
			НаборЗаписей.Отбор.Период.Установить(ДатаИзмененияПроцентаСписания);
			НаборЗаписей.Прочитать();
			Если НаборЗаписей.Количество() = 0 Тогда
				НоваяЗапись = НаборЗаписей.Добавить();
				НоваяЗапись.РазделСчетаДЕПО = Объект.Ссылка;
				НоваяЗапись.Период = ДатаИзмененияПроцентаСписания;
			ИначеЕсли НаборЗаписей.Количество() = 1 Тогда
				НоваяЗапись = НаборЗаписей[0];
			Иначе
				Возврат;
			КонецЕсли;
			НоваяЗапись.ПроцентСписания = ПроцентСписанияСРаздела;
			НаборЗаписей.Записать();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьИДоступностьЭлементовФормы()
	Элементы.ГруппаСубклиент.Доступность = Перечисления.ТипыСчетовДепо.НоминальныхДержателей().Найти(Объект.Владелец.ТипСчетаДепо) <> Неопределено;
	Элементы.Субклиент.Доступность = Объект.РазделСубклиента;
	Элементы.Субклиент.ОтметкаНезаполненного = Объект.РазделСубклиента;
	Элементы.Субклиент.АвтоОтметкаНезаполненного = Объект.РазделСубклиента;
	
	Видимость = Объект.ТипРазделаСчетаДЕПО = ПредопределенноеЗначение("Перечисление.ТипыРазделовСчетовДЕПО.БлокированоОбособленный");
	Элементы.СписаниеПоПредписанию.Видимость = Видимость;
	Элементы.СписаниеПоПредписаниюБР.Видимость = Видимость;
	Элементы.ПроцентСписания.Видимость = Видимость;
	Элементы.ПроцентСписанияСРаздела.Видимость = Видимость;
	Элементы.ДатаИзмененияПроцентаСписания.Видимость = Видимость;
	Элементы.ПоказатьИсториюИзмененияПроцентаСписания.Видимость = Видимость;
КонецПроцедуры

&НаКлиенте
Процедура РазделСубклиентаПриИзменении(Элемент)
	УстановитьВидимостьИДоступностьЭлементовФормы();
КонецПроцедуры

&НаКлиенте
Процедура ТипРазделаСчетаДЕПОПриИзменении(Элемент)
	
	УстановитьВидимостьИДоступностьЭлементовФормы();
	РаботаСДиалогамиКлиент.ТипРазделаСчетаДЕПОПриИзменении(Элемент, ЭтотОбъект);
	Объект.Наименование = НаименованиеРазделаСчетаДепоНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьИсториюИзмененияПроцентаСписания(Команда)
	
	ЗначениеОтбора = Новый Структура("РазделСчетаДЕПО", Объект.Ссылка);
	ПараметрыОткрытия = Новый Структура("Отбор", ЗначениеОтбора);
	ОткрытьФорму("РегистрСведений.ПроцентыСписанияЦБСОбособленногоРаздела.ФормаСписка", ПараметрыОткрытия);
	
КонецПроцедуры

&НаСервере
Функция ПараметрыОбособленногоРаздела(ДатаДанных)
	
	Результат = Новый Структура();
	Результат.Вставить("Дата", ДатаДанных);
	Результат.Вставить("ПроцентСписания", 0);

	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПроцентыСписанияЦБСОбособленногоРазделаСрезПоследних.Период КАК Период,
	|	ПроцентыСписанияЦБСОбособленногоРазделаСрезПоследних.ПроцентСписания КАК ПроцентСписания
	|ИЗ
	|	РегистрСведений.ПроцентыСписанияЦБСОбособленногоРаздела.СрезПоследних(&Дата, РазделСчетаДЕПО = &Раздел) КАК ПроцентыСписанияЦБСОбособленногоРазделаСрезПоследних";
	
	Запрос.УстановитьПараметр("Дата", ДатаДанных);
	Запрос.УстановитьПараметр("Раздел", Объект.Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Результат.Дата = Выборка.Период;
		Результат.ПроцентСписания = Выборка.ПроцентСписания;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ДатаИзмененияПроцентаСписанияПриИзменении(Элемент)
	
	Модифицированность = Истина;
	ПараметрыОбособленногоРаздела = ПараметрыОбособленногоРаздела(ДатаИзмененияПроцентаСписания);
	ПроцентСписанияСРаздела = ПараметрыОбособленногоРаздела.ПроцентСписания;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроцентСписанияСРазделаПриИзменении(Элемент)
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура РазделСчетаДепоМХНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	РаботаСДиалогамиКлиент.РазделСчетаДепоМХНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура РазделСчетаДепоМХАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	ДанныеВыбора = РаботаСДиалогамиКлиент.ДанныеВыбораСУчетомТипаРаздела(
	Объект.ТипРазделаСчетаДЕПО, ПараметрыПолученияДанных, СтандартнаяОбработка);
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ПараметрыОбособленногоРаздела = ПараметрыОбособленногоРаздела(ТекущаяДатаСеанса());
	ПроцентСписанияСРаздела = ПараметрыОбособленногоРаздела.ПроцентСписания;
	ДатаИзмененияПроцентаСписания = ПараметрыОбособленногоРаздела.Дата;
	
КонецПроцедуры

&НаСервере
Функция НаименованиеРазделаСчетаДепоНаСервере()
	СправочникОбъект = РеквизитФормыВЗначение("Объект", Тип("СправочникОбъект.РазделыСчетаДепо"));
	Возврат СправочникОбъект.НаименованиеРазделаСчетаДепо();
КонецФункции
